import { ReviewKeywordType } from '@/types/ProductReviewTypes';

export const REVIEW_KEYWORD: ReviewKeywordType = {
  키보드: {
    키감: ['좋아요', '보통이에요', '아쉬워요'],
    소리: ['조용해요', '보통이에요', '시끄러워요'],
    내구성: ['좋아요', '보통이에요', '아쉬워요'],
  },
  키캡: {
    색감: ['좋아요', '보통이에요', '아쉬워요'],
    텍스처: ['좋아요', '보통이에요', '아쉬워요'],
    내구성: ['좋아요', '보통이에요', '아쉬워요'],
  },
  스위치: {
    반응속도: ['빨라요', '보통이에요', '느려요'],
    소리: ['조용해요', '보통이에요', '시끄러워요'],
    내구성: ['좋아요', '보통이에요', '아쉬워요'],
  },
  기타용품: {
    호환성: ['좋아요', '보통이에요', '아쉬워요'],
    편의성: ['좋아요', '보통이에요', '아쉬워요'],
    내구성: ['좋아요', '보통이에요', '아쉬워요'],
  },
};
